-- Запрос
analyse movie_attribute_value;
explain select value_text
from movie_attribute_value
where value_int is not null;

-- План при 10 000 строк
-- +----------------------------------------------------------------------+
-- |QUERY PLAN                                                            |
-- +----------------------------------------------------------------------+
-- |Seq Scan on movie_attribute_value  (cost=0.00..105.00 rows=1 width=11)|
-- |  Filter: (value_int IS NOT NULL)                                     |
-- +----------------------------------------------------------------------+

-- План при 10 000 000 строк
-- +---------------------------------------------------------------------------------------+
-- |QUERY PLAN                                                                             |
-- +---------------------------------------------------------------------------------------+
-- |Gather  (cost=1000.00..70118.30 rows=1 width=11)                                       |
-- |  Workers Planned: 2                                                                   |
-- |  ->  Parallel Seq Scan on movie_attribute_value  (cost=0.00..69118.20 rows=1 width=11)|
-- |        Filter: (value_int IS NOT NULL)                                                |
-- +---------------------------------------------------------------------------------------+

-- Оптимизации
create index movie_attribute_value_value_int_index on movie_attribute_value (value_int);

-- План при 10 000 000 строк после оптимизаций
-- +------------------------------------------------------------------------------------------------------------------+
-- |QUERY PLAN                                                                                                        |
-- +------------------------------------------------------------------------------------------------------------------+
-- |Index Scan using movie_attribute_value_value_int_index on movie_attribute_value  (cost=0.43..8.45 rows=1 width=11)|
-- |  Index Cond: (value_int IS NOT NULL)                                                                             |
-- +------------------------------------------------------------------------------------------------------------------+
