-- Запрос
analyse movie;
explain select name from movie where name like ('a%');

-- План при 10 000 строк
-- +------------------------------------------------------+
-- |QUERY PLAN                                            |
-- +------------------------------------------------------+
-- |Seq Scan on movie  (cost=0.00..36.00 rows=20 width=11)|
-- |  Filter: ((name)::text ~~ 'a%'::text)                |
-- +------------------------------------------------------+


-- План при 10 000 000 строк
-- +---------------------------------------------------------------------------+
-- |QUERY PLAN                                                                 |
-- +---------------------------------------------------------------------------+
-- |Gather  (cost=1000.00..26268.07 rows=40404 width=11)                       |
-- |  Workers Planned: 2                                                       |
-- |  ->  Parallel Seq Scan on movie  (cost=0.00..21227.67 rows=16835 width=11)|
-- |        Filter: ((name)::text ~~ 'a%'::text)                               |
-- +---------------------------------------------------------------------------+

-- Оптимизации



-- План при 10 000 000 строк после оптимизаций
